performance/spike/23127280_Spike_20260815.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="23127280 - Spike - Scenario B Coupon Purchase" enabled="true">
      <stringProp name="TestPlan.comments">Standard JMeter 5.6.3 spike plan. L is mandatory and is never inferred. Profile: 0.2L for 60s, ramp to 2L in 10s, hold 60s, ramp down over 10s, observe 0.2L for 120s. Run measured tests only in CLI after a passing 1-VU preflight and explicit student approval.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="base_url" elementType="Argument"><stringProp name="Argument.name">base_url</stringProp><stringProp name="Argument.value">${__P(base_url,http://localhost:3000)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
    <elementProp name="users_csv" elementType="Argument"><stringProp name="Argument.name">users_csv</stringProp><stringProp name="Argument.value">${__P(users_csv,performance/data/users.csv)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="L" elementType="Argument"><stringProp name="Argument.name">L</stringProp><stringProp name="Argument.value">${__P(L,)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="baseline_factor" elementType="Argument"><stringProp name="Argument.name">baseline_factor</stringProp><stringProp name="Argument.value">${__P(baseline_factor,0.2)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="spike_factor" elementType="Argument"><stringProp name="Argument.name">spike_factor</stringProp><stringProp name="Argument.value">${__P(spike_factor,2.0)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="baseline_seconds" elementType="Argument"><stringProp name="Argument.name">baseline_seconds</stringProp><stringProp name="Argument.value">${__P(baseline_seconds,60)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="spike_ramp_seconds" elementType="Argument"><stringProp name="Argument.name">spike_ramp_seconds</stringProp><stringProp name="Argument.value">${__P(spike_ramp_seconds,10)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="spike_hold_seconds" elementType="Argument"><stringProp name="Argument.name">spike_hold_seconds</stringProp><stringProp name="Argument.value">${__P(spike_hold_seconds,60)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="spike_ramp_down_seconds" elementType="Argument"><stringProp name="Argument.name">spike_ramp_down_seconds</stringProp><stringProp name="Argument.value">${__P(spike_ramp_down_seconds,10)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="recovery_seconds" elementType="Argument"><stringProp name="Argument.name">recovery_seconds</stringProp><stringProp name="Argument.value">${__P(recovery_seconds,120)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="think_min_ms" elementType="Argument"><stringProp name="Argument.name">think_min_ms</stringProp><stringProp name="Argument.value">${__P(think_min_ms,250)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="think_max_ms" elementType="Argument"><stringProp name="Argument.name">think_max_ms</stringProp><stringProp name="Argument.value">${__P(think_max_ms,750)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="run_id" elementType="Argument"><stringProp name="Argument.name">run_id</stringProp><stringProp name="Argument.value">${__P(run_id,)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="result_path" elementType="Argument"><stringProp name="Argument.name">result_path</stringProp><stringProp name="Argument.value">${__P(result_path,)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="report_path" elementType="Argument"><stringProp name="Argument.name">report_path</stringProp><stringProp name="Argument.value">${__P(report_path,)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Scenario B Users CSV" enabled="true">
        <stringProp name="delimiter">,</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="filename">${users_csv}</stringProp>
<boolProp name="ignoreFirstLine">true</boolProp><boolProp name="quotedData">true</boolProp><boolProp name="recycle">true</boolProp>
<stringProp name="shareMode">shareMode.all</stringProp><boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">email,password,search_keyword,product_id,quantity,coupon_code,shipping_address</stringProp>
      </CSVDataSet>
      <hashTree/>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="00 - Validate mandatory properties" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptestnow</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">1</stringProp></elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp><stringProp name="ThreadGroup.ramp_time">1</stringProp><boolProp name="ThreadGroup.scheduler">false</boolProp><boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Validate L, run_id, CSV and profile" enabled="true">
          <stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp><stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">def failures = []
def lRaw = props.get('L')
if (!lRaw || !(lRaw ==~ /[1-9]\d*/)) failures &lt;&lt; '-JL must be a positive integer produced by calibration'
if (!props.get('run_id')) failures &lt;&lt; '-Jrun_id is required'
def csvPath = new File(vars.get('users_csv'))
if (!csvPath.isAbsolute()) csvPath = new File(System.getProperty('user.dir'), vars.get('users_csv'))
if (!csvPath.isFile()) failures &lt;&lt; 'users_csv not found: ' + csvPath
['baseline_seconds','spike_ramp_seconds','spike_hold_seconds','spike_ramp_down_seconds','recovery_seconds'].each { key -&gt;
  try { if (vars.get(key).toInteger() &lt;= 0) failures &lt;&lt; key + ' must be positive' } catch (ignored) { failures &lt;&lt; key + ' must be an integer' }
}
if (failures) { SampleResult.setSuccessful(false); SampleResult.setResponseCode('400'); SampleResult.setResponseMessage(failures.join('; ')); return }
props.put('spike.run.start.ms', System.currentTimeMillis().toString())
SampleResult.setResponseCode('200'); SampleResult.setResponseMessage('Spike inputs validated; L=' + lRaw)</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
      <TestFragmentController guiclass="TestFragmentControllerGui" testclass="TestFragmentController" testname="Scenario B - Coupon Purchase" enabled="true"/>
      <hashTree>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Scenario B - Coupon Purchase E2E" enabled="true"><boolProp name="TransactionController.includeTimers">false</boolProp><boolProp name="TransactionController.parent">true</boolProp></TransactionController>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON and bearer headers" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp><elementProp name="" elementType="Header"><stringProp name="Header.name">Accept</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp><elementProp name="" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${token}</stringProp></elementProp><elementProp name="" elementType="Header"><stringProp name="Header.name">X-Performance-Run</stringProp><stringProp name="Header.value">${run_id}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="01 POST /api/login" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;email&quot;:&quot;${email}&quot;,&quot;password&quot;:&quot;${password}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">${base_url}/api/login</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy>
          <hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Login returns 200" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp><stringProp name="Assertion.custom_message">Login must succeed</stringProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract token and user id" enabled="true"><stringProp name="JSONPostProcessor.referenceNames">token;user_id</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.token;$.user.id</stringProp><stringProp name="JSONPostProcessor.match_numbers">1;1</stringProp><stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND;NOT_FOUND</stringProp></JSONPostProcessor><hashTree/></hashTree>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="02 GET /api/products search" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="search" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">true</boolProp><stringProp name="Argument.name">search</stringProp><stringProp name="Argument.value">${search_keyword}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">${base_url}/api/products</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy>
          <hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Search returns JSON array" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="1">^\s*\[</stringProp></collectionProp><stringProp name="Assertion.custom_message">Product search must return an array</stringProp><stringProp name="Assertion.test_field">Assertion.response_data</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">2</intProp></ResponseAssertion><hashTree/></hashTree>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="03 GET /api/products/{product_id}" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp><stringProp name="HTTPSampler.path">${base_url}/api/products/${product_id}</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy>
          <hashTree><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract product name and price" enabled="true"><stringProp name="JSONPostProcessor.referenceNames">product_name;product_price</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.name;$.price</stringProp><stringProp name="JSONPostProcessor.match_numbers">1;1</stringProp><stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND;NOT_FOUND</stringProp></JSONPostProcessor><hashTree/><JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Product name present and price positive" enabled="true"><stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="script">def failures = []; def name = vars.get('product_name'); if (!name || name == 'NOT_FOUND' || name.trim().isEmpty()) failures &lt;&lt; 'product_name must be present'; try { if (new BigDecimal(vars.get('product_price')) &lt;= 0) failures &lt;&lt; 'product_price must be greater than zero' } catch (ignored) { failures &lt;&lt; 'product_price must be numeric' }; if (failures) { AssertionResult.setFailure(true); AssertionResult.setFailureMessage(failures.join('; ')) }</stringProp></JSR223Assertion><hashTree/></hashTree>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="04 POST /api/cart" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;id&quot;:${product_id},&quot;name&quot;:&quot;${product_name}&quot;,&quot;price&quot;:${product_price},&quot;quantity&quot;:${quantity}}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">${base_url}/api/cart</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy>
          <hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Cart add succeeds" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="1">Added to cart</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_data</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">16</intProp></ResponseAssertion><hashTree/></hashTree>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="05 GET /api/cart" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp><stringProp name="HTTPSampler.path">${base_url}/api/cart</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy>
          <hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Cart contains product id" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="1">&quot;id&quot;:${product_id}</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_data</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">16</intProp></ResponseAssertion><hashTree/></hashTree>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="06 POST /api/apply-coupon" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;code&quot;:&quot;${coupon_code}&quot;,&quot;total_amount&quot;:${subtotal},&quot;user_id&quot;:${user_id}}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">${base_url}/api/apply-coupon</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy>
          <hashTree><JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Calculate subtotal" enabled="true"><stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="script">def price = new BigDecimal(vars.get('product_price')); def qty = new BigDecimal(vars.get('quantity')); vars.put('subtotal', price.multiply(qty).stripTrailingZeros().toPlainString())</stringProp></JSR223PreProcessor><hashTree/><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract coupon amounts" enabled="true"><stringProp name="JSONPostProcessor.referenceNames">coupon_id;discount_amount;final_amount</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.coupon_id;$.discount_amount;$.final_amount</stringProp><stringProp name="JSONPostProcessor.match_numbers">1;1;1</stringProp><stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND;NOT_FOUND;NOT_FOUND</stringProp></JSONPostProcessor><hashTree/><JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Coupon produces a valid positive discount" enabled="true"><stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="script">def failures = []; try { def subtotalValue = new BigDecimal(vars.get('subtotal')); def discount = new BigDecimal(vars.get('discount_amount')); def finalAmount = new BigDecimal(vars.get('final_amount')); if (discount &lt;= 0) failures &lt;&lt; 'discount_amount must be greater than zero'; if (finalAmount &lt;= 0) failures &lt;&lt; 'final_amount must be greater than zero'; if (finalAmount &gt;= subtotalValue) failures &lt;&lt; 'final_amount must be less than subtotal' } catch (ignored) { failures &lt;&lt; 'subtotal, discount_amount, and final_amount must be numeric' }; if (failures) { AssertionResult.setFailure(true); AssertionResult.setFailureMessage(failures.join('; ')) }</stringProp></JSR223Assertion><hashTree/></hashTree>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="07 POST /api/checkout using final_amount" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;total_amount&quot;:${final_amount},&quot;shipping_address&quot;:&quot;${shipping_address}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">${base_url}/api/checkout</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy>
          <hashTree><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract orderId" enabled="true"><stringProp name="JSONPostProcessor.referenceNames">orderId</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.orderId</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp><stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp></JSONPostProcessor><hashTree/><JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Checkout created an order" enabled="true"><stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="script">if (vars.get('orderId') == 'NOT_FOUND') { AssertionResult.setFailure(true); AssertionResult.setFailureMessage('Checkout response did not contain orderId') }</stringProp></JSR223Assertion><hashTree/></hashTree>

          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Only after successful checkout" enabled="true"><stringProp name="IfController.condition">${JMeterThread.last_sample_ok}</stringProp><boolProp name="IfController.evaluateAll">false</boolProp><boolProp name="IfController.useExpression">true</boolProp></IfController>
          <hashTree><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="08 POST /api/coupon-usage" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;coupon_id&quot;:${coupon_id}}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">${base_url}/api/coupon-usage</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy><hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Coupon usage recorded" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="1">Usage recorded</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_data</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">16</intProp></ResponseAssertion><hashTree/></hashTree></hashTree>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="09 GET /api/orders/my-orders" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp><stringProp name="HTTPSampler.path">${base_url}/api/orders/my-orders</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy>
          <hashTree><JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="My orders contains new orderId" enabled="true"><stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="script">try { def orders = new groovy.json.JsonSlurper().parseText(prev.getResponseDataAsString()); def expected = vars.get('orderId'); if (!(orders instanceof List) || expected == 'NOT_FOUND' || !orders.any { it.id?.toString() == expected }) { AssertionResult.setFailure(true); AssertionResult.setFailureMessage('New orderId ' + expected + ' was not found in my-orders') } } catch (Exception e) { AssertionResult.setFailure(true); AssertionResult.setFailureMessage('my-orders was not valid JSON: ' + e.message) }</stringProp></JSR223Assertion><hashTree/></hashTree>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="01 - Baseline and recovery (0.2L)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true"><boolProp name="LoopController.continue_forever">true</boolProp><stringProp name="LoopController.loops">-1</stringProp></elementProp>
        <stringProp name="ThreadGroup.num_threads">${__groovy(Math.max(1\, Math.ceil(props.get('L').toInteger() * (props.get('baseline_factor') ?: '0.2').toBigDecimal()).toInteger()),baseline_threads)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp><longProp name="ThreadGroup.start_time">0</longProp><longProp name="ThreadGroup.end_time">0</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__groovy(vars.get('baseline_seconds').toInteger()+vars.get('spike_ramp_seconds').toInteger()+vars.get('spike_hold_seconds').toInteger()+vars.get('spike_ramp_down_seconds').toInteger()+vars.get('recovery_seconds').toInteger(),total_duration_seconds)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp><boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
<ModuleController guiclass="ModuleControllerGui" testclass="ModuleController" testname="Scenario B - baseline" enabled="true"><collectionProp name="ModuleController.node_path"><stringProp name="0">WorkBench</stringProp><stringProp name="1">23127280 - Spike - Scenario B Coupon Purchase</stringProp><stringProp name="2">Scenario B - Coupon Purchase</stringProp></collectionProp></ModuleController><hashTree/>
        <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Think time between workflows" enabled="true"><intProp name="ActionProcessor.action">1</intProp><intProp name="ActionProcessor.target">0</intProp><stringProp name="ActionProcessor.duration">${__groovy(org.apache.commons.lang3.RandomUtils.nextLong(vars.get('think_min_ms').toLong()\, vars.get('think_max_ms').toLong()+1),think_ms)}</stringProp></TestAction><hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="02 - Spike add-on (to 2L)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true"><boolProp name="LoopController.continue_forever">true</boolProp><stringProp name="LoopController.loops">-1</stringProp></elementProp>
        <stringProp name="ThreadGroup.num_threads">${__groovy(Math.max(1\, Math.ceil(props.get('L').toInteger() * (props.get('spike_factor') ?: '2.0').toBigDecimal()).toInteger() - Math.ceil(props.get('L').toInteger() * (props.get('baseline_factor') ?: '0.2').toBigDecimal()).toInteger()),spike_extra_threads)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${spike_ramp_seconds}</stringProp><longProp name="ThreadGroup.start_time">0</longProp><longProp name="ThreadGroup.end_time">0</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__groovy(vars.get('spike_ramp_seconds').toInteger()+vars.get('spike_hold_seconds').toInteger()+vars.get('spike_ramp_down_seconds').toInteger()+15,spike_group_duration_seconds)}</stringProp>
        <stringProp name="ThreadGroup.delay">${baseline_seconds}</stringProp><boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Stagger spike thread stop across ramp-down window" enabled="true">
          <stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp><stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">long runStart = props.get('spike.run.start.ms').toLong()
long downStart = runStart + (vars.get('baseline_seconds').toLong() + vars.get('spike_ramp_seconds').toLong() + vars.get('spike_hold_seconds').toLong()) * 1000L
int total = ctx.getThreadGroup().getNumThreads()
long slot = Math.max(1L, vars.get('spike_ramp_down_seconds').toLong() * 1000L / Math.max(1, total))
long stopAt = downStart + (ctx.getThreadNum() + 1L) * slot
if (System.currentTimeMillis() &gt;= stopAt) ctx.getThread().stop()</stringProp>
        </JSR223PreProcessor><hashTree/>
<ModuleController guiclass="ModuleControllerGui" testclass="ModuleController" testname="Scenario B - spike" enabled="true"><collectionProp name="ModuleController.node_path"><stringProp name="0">WorkBench</stringProp><stringProp name="1">23127280 - Spike - Scenario B Coupon Purchase</stringProp><stringProp name="2">Scenario B - Coupon Purchase</stringProp></collectionProp></ModuleController><hashTree/>
        <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Think time between workflows" enabled="true"><intProp name="ActionProcessor.action">1</intProp><intProp name="ActionProcessor.target">0</intProp><stringProp name="ActionProcessor.duration">${__groovy(org.apache.commons.lang3.RandomUtils.nextLong(vars.get('think_min_ms').toLong()\, vars.get('think_max_ms').toLong()+1),think_ms)}</stringProp></TestAction><hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="POST-RUN ONLY - View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp><objProp><name>saveConfig</name><value class="SampleSaveConfiguration"><time>true</time><latency>true</latency><timestamp>true</timestamp><success>true</success><label>true</label><code>true</code><message>true</message><threadName>true</threadName><dataType>true</dataType><encoding>false</encoding><assertions>true</assertions><subresults>true</subresults><responseData>false</responseData><samplerData>false</samplerData><xml>false</xml><fieldNames>true</fieldNames><responseHeaders>false</responseHeaders><requestHeaders>false</requestHeaders><responseDataOnError>true</responseDataOnError><saveAssertionResultsFailureMessage>true</saveAssertionResultsFailureMessage><assertionsResultsToSave>0</assertionsResultsToSave><bytes>true</bytes><sentBytes>true</sentBytes><url>true</url><threadCounts>true</threadCounts><idleTime>true</idleTime><connectTime>true</connectTime></value></objProp><stringProp name="filename"></stringProp>
      </ResultCollector><hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>